<?php
header("Content-Type: text/plain; charset=utf-8");
error_reporting(-1);

/* Коды для замены букв */
$code = array(
    'А' => '4',
    'Б' => '6',
    'В' => '8',
    'Г' => 'r',
    'Д' => 'D',
    'Е' => '€',
    'З' => '3',
    'Ж' => '>|<',
    'И' => 'N',
    'K' => '|<',
    'Л' => '^',
    'М' => '[/\/\]',
    'Н' => '}-{',
    'О' => '0',
    'П' => '|*|',
    'P' => 'R',
    'С' => ')',
    'Т' => '+',
    'У' => 'Y',
    'Ф' => '*|*',
    'Х' => '}{',
    'Ц' => ']{',
    'Ч' => '4',
    'Ш' => '|||',
    'Щ' => '||{',
    'Ы' => 'lb',
    'Э' => '=)',
    'Ю' => '|o',
    'Я' => 'R'
);

$text = 'Я У МАМЫ ПИ-ЭЙЧ-ПИ ИНЖЕНЕР-ПРОГРАММИСТ';
$l33t = strtr($text, $code);

echo "Ты говоришь: {$text}\nА хакеры говорят: {$l33t}\n";