<?php
header("Content-Type: text/plain; charset=utf-8");
error_reporting(-1);

/* Коды для замены букв */
$code = array(
    'а'	=>	'1',
    'б'	=>	'2',
    'в'	=>	'3',
    'г'	=>	'4',
    'д'	=>	'5',
    'е'	=>	'6',
    'ё'	=>	'7',
    'ж'	=>	'8',
    'з'	=>	'9',
    'и'	=>	'0',
    'й'	=>	'#',
    'к'	=>	'!',
    'л'	=>	'@',
    'м'	=>	'$',
    'н'	=>	'%',
    'о'	=>	'^',
    'п'	=>	'&',
    'р'	=>	'*',
    'с'	=>	'(',
    'т'	=>	')',
    'у'	=>	'-',
    'ф'	=>	'=',
    'х'	=>	'Ђ',
    'ц'	=>	'_',
    'ч'	=>	'{',
    'ш'	=>	'}',
    'щ'	=>	'[',
    'ь'	=>	']' ,
    'ы'	=>	',',
    'ъ'	=>	'¤',
    'э'	=>	'µ',
    'ю'	=>	'~',
    'я'	=>	';'

);

$text = 'нас предали. явка провалена.';
$cipher = strtr($text, $code);

echo "Оригинал: {$text}\nШифровка: {$cipher}\n";

$flipped = array_flip($code);

$decode = strtr($text, $flipped);

echo "<br>".$decode;