<?php
error_reporting(-1);
/* Коды для замены букв */
$code = array(
    'а'	=>	'ァ',
    'б'	=>	'ィ',
    'в'	=>	'ゥ',
    'г'	=>	'ウ',
    'д'	=>	'ェ',
    'е'	=>	'ォ',
    'ё'	=>	'カ',
    'ж'	=>	'キ',
    'з'	=>	'ク',
    'и'	=>	'コ',
    'й'	=>	'シ',
    'к'	=>	'ス',
    'л'	=>	'ズ',
    'м'	=>	'セ',
    'н'	=>	'ソ',
    'о'	=>	'タ',
    'п'	=>	'ダ',
    'р'	=>	'チ',
    'с'	=>	'ッ',
    'т'	=>	'テ',
    'у'	=>	'ト',
    'ф'	=>	'ニ',
    'х'	=>	'ネ',
    'ц'	=>	'ノ',
    'ч'	=>	'ハ',
    'ш'	=>	'フ',
    'щ'	=>	'ヘ',
    'ь'	=>	'ベ',
    'ы'	=>	'ペ',
    'ъ'	=>	'ホ',
    'э'	=>	'ミ',
    'ю'	=>	'ョ',
    'я'	=>	'ヰ'

);

$text = 'нас предали. явка провалена.';
$cipher = strtr($text, $code);
echo "Оригинал: {$text}\nШифровка: {$cipher}\n";
$flipped = array_flip($code);
$decode = strtr($text, $flipped);
echo "<br>".$decode;